---
kind: method
id: M:Autodesk.Revit.UI.PreviewControl.Dispose
source: html/0547edfb-f6fe-3c29-7e2f-5e271fffb2a3.htm
---
# Autodesk.Revit.UI.PreviewControl.Dispose Method

This method is called if the user explicitly disposes of the
object (by calling the Dispose method in other managed languages,
or the destructor in C++).

## Syntax (C#)
```csharp
public void Dispose()
```